title: Ransomware Shadow Copy Deletion
id: 1122aabb-3344-ccdd-5566-77889900aa11
status: experimental
description: Detects shadow copy deletion often used by ransomware to prevent recovery
author: Tirthraj Sisodiya
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: "vssadmin.exe"
    CommandLine|contains: "delete shadows"
  condition: selection
fields:
  - EventID
  - CommandLine
  - User
falsepositives:
  - Legitimate system maintenance
level: critical
